import 'package:flutter/material.dart';
import 'package:carousel_pro/carousel_pro.dart';

class Deer extends StatefulWidget {
  @override
  _DeerState createState() => _DeerState();
}

class _DeerState extends State<Deer> {
  @override
  Widget build(BuildContext context) {
    final image_carousel = new Container(
        height: 350,
        child: new Carousel(
          boxFit: BoxFit.cover,
          images: [
            AssetImage("Images/Deer/Deer.jpg"),
            AssetImage("Images/Deer/1.jpg"),
            AssetImage("Images/Deer/2.jpg"),
            AssetImage("Images/Deer/3.jpg"),
            AssetImage("Images/Deer/4.jpg"),
            AssetImage("Images/Deer/5.jpg"),
            AssetImage("Images/Deer/6.jpg"),
            AssetImage("Images/Deer/7.jpg"),
            AssetImage("Images/Deer/8.jpg"),
            AssetImage("Images/Deer/9.jpg"),
          ],
          autoplay: true,
          animationCurve: Curves.fastOutSlowIn,
          animationDuration: Duration(milliseconds: 2000),
        ));

    return Scaffold(
      appBar: AppBar(backgroundColor: Colors.orange,
        title: Text(
          "Deer",
          style: TextStyle(color: Colors.black, fontSize: 20),
        ),
        toolbarHeight: 80,
        centerTitle: true,
      ),
      backgroundColor: Colors.amber,
      body: ListView(
        children: [image_carousel,
          Padding(
            padding: const EdgeInsets.all(32.0),
            child: Text(
                  "\nالغوال\n"
                  "يتميز حيوان الغزال بوجود أربع قوائم يقف عليها وفي نهايتها حوافر مشقوقة لسهولة عملية التنقل والجري السريعة التي يقوم بها، كما أن له جسم مدمج مع الأرجل الطويلة والرأس مع وجود ذيل صغير في نهاية الجسم من الخلف، ويمتلك حيوان الغزال قرونًا على رأسه تتميز بالشكل الجميل وكبر الحجم ومصنوعة من العظم وتحتوي على الأعصاب والأوعية الدموية، والتي يمكن أن تنكسر إذا علقت بشجرة أو بين الصخور، وهناك أنواع عديدة من فصائل الغزلان التي تنتمي إلى عائلات كبيرة جدًا، ويختلف حجم الغزال من نوع إلى آخر؛ إذ يوجد الغزلان الكبيرة جدًا والصغيرة جدًا أيضًا، وأصغر الغزلان حجمًا هو الجرو الجنوبي الذي يصل وزنه إلى حوالي 9 كيلوغرامات فقط  ويبلغ طوله حوالي 36 سم فقط للغزال البالغ، أما أكبر الغزلان هو الموس الذي يصل طوله إلى حوالي مترين من الحافر إلى نهاية الكتف ويصل وزنه إلى حوالي 820 كيلو غرام، وتمتلك جميع أنواع الغزلان قرونًا باستثناء إناث غزلان المياه الصينية؛ حيث يكون للذكور فقط قرون، كما أن أنثى حيوان الغزال الرنة يوجد له قرون تنمو في كل عام.\n"
                  "\n وما لحقه من عصور أخرى كنوع من الفن في رسم الحيوانات، وكان لها دور في الأساطير والأدب والدين عبر التاريخ كما في شعارات الشجاعة، ويمكن أكل لحم الغزال على الرغم من ارتفاع سعره، حيث يعطي أهمية اقتصادية في البيع، ويتميز جلد الغزال بالنعومة والقوة والمتانة، وكما يمكن استخدام قرونها في صناعة مقابض للسكاكين، فقد كان نشاط صيد الغزلان والاستفادة منها في التجارة مزدهرًا في العصور الوسطى كما لا يزال مصدرًا تجاريًا للعديد من الناس إلى الآن رغم قلة أعدادها مع مرور الزمن."
                  "\nاماكن عيش الغزال\n"
                  " والممرات النهرية المحاطة بالصحاري، وتعيش أغلب الغزلان الكبيرة الحجم في الغابات المعتدلة والسهول الواسعة في جميع أنحاء العالم، حيث تختار الغزلان أماكن عيشها على حسب توافر أنواع الأعشاب والحشائش التي ترغب في تناولها، وتتواجد الغزلان في جميع القارات باستثناء أستراليا والقارة القطبية الجنوبية، وتُعد أفريقيا موطن الغزلان الأصلي مثل الأيل البربري الذي يعيش في جبال الأطلس في شمال غرب أفريقيا وهو نوع من الغزلان الحمراء، ويوجد في  أمريكا الوسطى والجنوبية نوع من الغزلان الصغيرة، ويوجد حيوان الموس في منطقة البحر الكاريبي والتايغا، وتتركز الغزلان الكبيرة بشكل كبير في أمريكا الشمالية في منطقة جبال روكي الكندية وجبل كولومبيا وهي من أنواع الغزلان ذات الذيل الأبيض والأيل والكريبو وغيرها، ويمكن العثور عليها في سفوح ووديان الأنهار في جبال روكي الكندية بسبب وجود نموات لنباتات متساقطة يمكن التغذي عليها، وتُوجد معظم أنواع الغزلان في قارة آسيا على الرغم من التنوع القليل للأنواع النباتية والحيوانية هناك، ولكن الغزال البور الأوروبي اتخذ من جزيرة الأناضول في تركيا موطنًا له، وهناك بعض أنواع الغزلان التي قام الإنسان بنقلها من موطنها الأصلي واستطاعت\n "
                  "غذاء الغزال وطريقه تكاثره\n"
                  "تتغذى الغزلان بشكل أساسي على الأوراق، لأن أجسامها تحتوي على معدة صغيرة غير متخصصة لهضم اللحوم، لذلك تتناول الغزلان أوراق الأعشاب الطازجة والبراعم الصغيرة سهلة الهضم والأغصان الطرية والفاكهة والفطريات، حيث تمر هذه الأطعمة عن طريق القناة الهضمية الغذائية وتتعرض إلى التخمير والتقطيع بسرعة ليستفيد جسم الغزال من المواد الغذائية المهضمة في نموه ونمو القرون التي تتعرض للكسر أو الاستبدال أحيانًا، حيث يحتاج الغزال إلى كميات كبيرة من المعادن الضرورية للنمو مثل الكالسيوم والفوسفات اللازمة لدعم نمو القرون بشكل خاص، ولذلك يحتاج حيوان الغزال لاتباع نظام غذائي غني بالمواد الغذائية الضرورية، أما طريقة تكاثر الغزال فهي عن طريق الولادة حيث تلد أنثى الغزال التي تُسمى الظبي واحد أو اثنين في كل مرة، ويبدأ موسم \n"
              ,style: TextStyle(
                color: Colors.black,
                fontFamily: "Pacifico",
                fontSize: 20,
              ),
              textDirection: TextDirection.rtl,
            ),
          )
        ],
      ),
    );
  }
}
