import 'package:flutter/material.dart';
import 'package:carousel_pro/carousel_pro.dart';

class Frog extends StatefulWidget {
  @override
  _FrogState createState() => _FrogState();
}

class _FrogState extends State<Frog> {
  @override
  Widget build(BuildContext context) {
    final image_carousel = new Container(
        height: 350,
        child: new Carousel(
          boxFit: BoxFit.cover,
          images: [
            AssetImage("Images/Frog/Frog.jpg"),
            AssetImage("Images/Frog/1.jpg"),
            AssetImage("Images/Frog/2.jpg"),
            AssetImage("Images/Frog/3.jpg"),
            AssetImage("Images/Frog/4.jpg"),
            AssetImage("Images/Frog/5.jpg"),
            AssetImage("Images/Frog/6.jpg"),
            AssetImage("Images/Frog/7.jpg"),
            AssetImage("Images/Frog/8.jpg"),
            AssetImage("Images/Frog/9.jpg"),
          ],
          autoplay: true,
          animationCurve: Curves.fastOutSlowIn,
          animationDuration: Duration(milliseconds: 2000),
        ));

    return Scaffold(
      appBar: AppBar(backgroundColor: Colors.amber,
        title: Text(
          "Frog",
          style: TextStyle(color: Colors.black, fontSize: 20),
        ),
        toolbarHeight: 80,
        centerTitle: true,
      ),
      backgroundColor: Colors.amber,
      body:ListView(
        children: [image_carousel,
          Padding(
            padding: const EdgeInsets.all(32.0),
            child: Text(
              "\nالضفادع\n"
                  "الضّفادع من الحيوانات البرمائيّة الَّتي تَقضي جزءاً من حياتها في الماء والجزء الآخر على اليابسة، غير أنَّ بعض أنواعها لا تَعيش في الماء مطلقاً، وتحتوي المَناطق الاستوائيَّة على أكبر عدد من الضَّفادع، وينعدم وجودها في منطقة القطب الجنوبيّ، وتُشكِّل الضَّفادع غذاءً لعددٍ من الحيوانات، مثل: الخفافيش، والحيَّات، وثعالب الماء، وتَتغذَّى على الدِّيدان والمفصليَّات بشكلٍ عام.\n"
                  "\nللضَّفادع أهميَّة لدى الإنسان؛ حيث تُستَخدم بشكلٍ واسع في المختبرات؛ لاختبار الأدوية الجديدة، كما تُستخدم للتَّشريح، ولها أنواع كثيرة قد تصل إلى ألف نوع، ومن هذه الأنواع ما هو شديد السمِيَّة؛ حيث يحوي جلدها الرَّطب الأملس على غدد سمِيَّة أسفل الجلد يرشح السُّمُّ من خلالها عبر قنوات؛ للحماية من الأعداء، وتتميّز هذه الضَّفادع عادةً بألوانها الزَّاهية والمتعدّدة وحجمها الضَّئيل، ومن الضَّفادع السَّامة: الضّفدع الأزرق، والضّفدع الذَّهبي. "
                  "\nجسم الضفدع\n"
                  "\nالضّفدع من الحيوانات الَّتي لا ذيل لها، ويتكوَّن جسمه من رأس وجسم مُفلطحين، ولَيست له رقبة، وعيناه جاحظتان تُساعدانه على الرّؤية في الاتِّجاهات جميعها، ورجلاه الخلفيّتان طَويلتان تساعدانه على القفز لمسافاتٍ طويلة، وتنتهيان بأصابع مُترابطة بأغشيةٍ رقيقة؛ لتساعده على السِّباحة، ورجلاه الأماميّتان قصيرتان، ولسانه طويل لاصق سريع الحركة؛ ليساعده على التقاط الفرائس بسرعة، وتقع أسنان الضَّفدع جميعها في فكَّه العلويّ، وليست له أسنان في فكِّه السَّفلي."
                  "لون الضَّفادع أخضر، وهناك ضفادع بنيَّة وأخرى مرقَّطة، ويتراوح حجمها من سنتيمتر واحد إلى حوالي ثلاثين سنتميتراً أو أكثر بقليل. والضَّفادع من الحيوانات ذوات الدَّم البارد؛ حيث تتساوى درجة حرارة جسمها مع درجة حرارة الهواء أو الماء المحيط بها؛ لذلك تلجأ أغلب الضَّفادع في المناطق الباردة إلى السُّبات في فصل الشِّتاء.\n"
                  "\nالتكاثر عند الضفادع\n"
                  "في موسم التَّكاثر يُصدر الضّفدع الذَّكر صوتاً يُسمَّى النّقيق من خلال الأوتار الصَّوتيَّة الموجودة في الحنجرة لدعوة الإناث، ويكون موسم التَّكاثر عادةً في نهاية فصل الرَّبيع وبداية الصَّيف، وصوت الضّفدع الذَّكر أعلى من صوت الأنثى، ومُعظم أنواعها لها كيس صوتيّ ينتفخ عند إصدار الأصوات، وتَتزاوج معظم أنواعها عادةً في البرك والبحيرات؛ حيث يقوم الضّفدع الذَّكر بتخصيب البيض مباشرة عند وضعه في الماء.\n "
                  "\nمراحل نمو الضفدع\n"
                  "يَمرُّ الضّفدع أثناء نموّه بمراحل متعدّدة؛ حيث يَبدأ حياته بعد فقس بيضه الموضوع في الماء، ويكون له ذيل طويل يساعده على السِّباحة في الماء الذي يَعيش فيه، ويتنفّس بالخياشيم، ويُسمَّى بأبي ذنيبة أو الشَّرغوف، وتتراوح المدَّة اللَّازمة لفقس البيض عند الضّفدع بين ثلاثة أيَّام وخمسة وعشرين يوماً حسب درجة حرارة الماء؛ فكلَّما زادت درجة حرارة الماء زادت سرعة فقس البيض، ثمَّ ينمو أبو ذنيبة ويصبح بعد أشهر قليلة ضفدعاً بالغاً يتنفّس باستخدام الرِّئتين وجلده الرَّطب الأملس الذي يذيب الأكسجين ويوصله إلى الدَّم، ويتغذَّى على المفصليَّات والدِّيدان.\n"


              ,style: TextStyle(
                color: Colors.black,
                fontFamily: "Pacifico",
                fontSize: 20,
              ),
              textDirection: TextDirection.rtl,
            ),
          )
        ],
      ),
    );
  }
}
