import 'package:flutter/material.dart';
import 'package:carousel_pro/carousel_pro.dart';

class Lioness extends StatefulWidget {
  @override
  _LionessState createState() => _LionessState();
}

class _LionessState extends State<Lioness> {
  @override
  Widget build(BuildContext context) {
    final image_carousel = new Container(
        height: 350,
        child: new Carousel(
          boxFit: BoxFit.cover,
          images: [
            AssetImage("Images/lions/3.jpg"),
            AssetImage("Images/lions/2.jpg"),
            AssetImage("Images/lions/8.jpg"),
            AssetImage("Images/lions/9.jpg"),
            AssetImage("Images/lions/10.jpg"),
            AssetImage("Images/lions/21.jpg"),
          ],
          autoplay: true,
          animationCurve: Curves.fastOutSlowIn,
          animationDuration: Duration(milliseconds: 2000),
        ));

    return Scaffold(
      appBar: AppBar(backgroundColor: Colors.amber,
        title: Text(
          "Lioness",
          style: TextStyle(color: Colors.black, fontSize: 20),
        ),
        toolbarHeight: 80,
        centerTitle: true,
      ),
      backgroundColor: Colors.amber,
      body: ListView(
        children: [image_carousel,
          Padding(
            padding: const EdgeInsets.all(32.0),
            child: Text(
              "\nانثي الاسد\n"
                  "\nأنثى الأسد هي إحدى فئات السنوريات  والتي تعد من الحيوانات البرية المفترسة التي تقتات على الحيوانات الكبيرة الأخرى، غالبًا ما تعيش في مجموعات وتكون مسؤولة عن عملية الصيد وإنجاب الأطفال وعلى الرغم من انتشارها في العديد من مناطق العالم قديمًا إلا أنها تعيش الآن بشكل أساسي في أفريقيا والهند، وهي تفضل العيش في مناطق السافانا والمناطق العشبية وتتواجد أيضًا في الغابات."
                  "\nصفات انثي الاسد\n"
                  "أنثى الأسد تعدّ من الحيوانات المتوحشة  كبيرة الحجم نوعًا ما، وهي ذات رأس دائري صغير ورقبة قصيرة، يتراوح لون فرائها من البيج الفاتح إلى البني الغامق وهو يخلو من البقع أو الخطوط، ولها ذيل يتراوح طوله من 72 سم إلى 89.5 سم، بينما يتراوح طول أجسادها من 160 سم إلى 184 سم، وتزن الأنواع التي تعيش في أفريقيا الجنوبية من 118.37 إلى 143.5، في حين تزن تلك التي تعيش في شرق أفريقيا حوالي 119.5 كغ،  أما الأنواع التي تعيش في الهند فتتراوح أوزانها بين 110 كغ و120 كغ.\n"
                  "\nطعام انثي الاسد\n"
                  "عادتًا ما تتجنب اللبؤات افتراس الحيوانات الكبيرة مثل الفيل وفرس النهر ووحيد القرن، كما تتجنب الحيوانات الصغيرة مثل الأرانب وبعض أنواع القردة، وتفضل بدلًا من ذلك افتراس حيوان النو  والحمر الوحشية، وهي لها القدرة على قتل الحيوانات المفترسة الأخرى مثل الفهود  والضباع المرقطة لكنها لا تأكلها في العادة، وغالبًا ما تستهلك قرابة 9 كغ من اللحم يوميًا، وبعضها قد يستهلك ما يصل إلى 45.5 كغ يوميًا.\n"
                  "\nاليه الصيد عند انثي الاسد\n"
                  "يشكل قلب أنثى الأسد ما نسبته 0.57% من وزن جسمها لذا فهي لا تستطيع الركض بأقصى سرعة لفترات طويلة، وغالبًا ما تبدأ عملية المطاردة بعد أن تقترب بشكل كبير من فريستها مما يساعدها في استغلال سرعتها القصوى، وعادة ما تحاول الاختباء بين الأشجار أو الصيد خلال الليل لتتمكن من الاقتراب من الفريسة  بهدوء ومن ثم الإمساك بها قبل أن تبدأ بالهرب، لتكون عملية المطاردة قصيرة وفعالة، وإذ كانت القفزة النهائية صائبة لن تتمكن الفريسة من الهرب وبالأخص بعد الإطباق عليها وخنقها بتلك الفكوك القوية، وتنجح أثنى الأسد في حوالي 30% فقط من محاولات الصيد، وترتفع نسبة النجاح عندما تشاركها إناث غيرها عملية الصيد.\n "
                  "\nسلوك انثي الاسد في المجموعات\n"
                  "تعيش أنثى الأسد عادة في مجموعات تسمى زمرة تتكون من أربعة أسود حدًّا أقصى والعديد من الإناث وصغارها من كلا الجنسين، وفي بعض الفصائل تتكون من أسد واحد وعدة إناث وصغارها، ويتم طرد الشبل الذكر من المجموعة بمجرد وصوله سن البلوغ أي عندما يصبح عمره ما بين سنتين إلى ثلاثة سنوات، ولا تتغير إناث الزمرة الواحدة عادة إلا بموت إحداهن، وفي حال تم طرد أنثى خارج الزمرة تتحول لنمط الارتحال، أي العيش بمفردها، في حال تعرضت الزمرة للهجوم يقوم الأسد بالدفاع عنها وقد تساعده في ذلك بعض الإناث، وغالبًا ما تقع مسؤولية الصيد على الإناث كما تتولى مسؤولية رعاية الأشبال وإطعامها.\n"



              ,style: TextStyle(
                color: Colors.black,
                fontFamily: "Pacifico",
                fontSize: 20,
              ),
              textDirection: TextDirection.rtl,
            ),
          )
        ],
      ),
    );
  }
}
