import 'package:flutter/material.dart';
import 'package:carousel_pro/carousel_pro.dart';

class Raccoon extends StatefulWidget {
  @override
  _RaccoonState createState() => _RaccoonState();
}

class _RaccoonState extends State<Raccoon> {
  @override
  Widget build(BuildContext context) {
    final image_carousel = new Container(
        height: 350,
        child: new Carousel(
          boxFit: BoxFit.cover,
          images: [
            AssetImage("Images/Raccoon/Raccoon.jpg"),
            AssetImage("Images/Raccoon/1.jpg"),
            AssetImage("Images/Raccoon/2.jpg"),
            AssetImage("Images/Raccoon/3.jpg"),
            AssetImage("Images/Raccoon/4.jpg"),
            AssetImage("Images/Raccoon/5.jpg"),
            AssetImage("Images/Raccoon/6.jpg"),
            AssetImage("Images/Raccoon/7.jpg"),
          ],
          autoplay: true,
          animationCurve: Curves.fastOutSlowIn,
          animationDuration: Duration(milliseconds: 2000),
        ));

    return Scaffold(
      appBar: AppBar(backgroundColor: Colors.amber,
        title: Text(
          "Raccoon",
          style: TextStyle(color: Colors.black, fontSize: 20),
        ),
        toolbarHeight: 80,
        centerTitle: true,
      ),
      backgroundColor: Colors.amber,
      body: ListView(
        children: [image_carousel,
          Padding(
            padding: const EdgeInsets.all(32.0),
            child: Text(
              "\nحيوان الراكون\n"
                  "يُعدّ الراكون حيوانًا ذا فراء سميك يغطيهِ من رأسهِ وحتى ذيلهِ، ويكون ذلك على شكل حلقات باللون البني أو الرمادي، ويمتلك خمسة أصابع في كل طرف من أطرافهِ الأمامية والخلفية، وقد يبلغ وزن حيوان الراكون ما يقارب 23 رطل، ويعيش عادةً حوالي 2 أو 3 سنوات في البرية، ويستطيع حيوان الراكون أنّ يقطع 15 ميل في الساعة، ويتميز أيضًا بأنّهُ سباح جيد، بالإضافة إلى أنّهُ يُعدّ حيوانًا ذكيًا يمكن مقارنتهُ بذكاء\n "
                  "\nالقرود\n"
                  "، والجدير بالذكر أنّ الراكون يُعدّ حيوانًا ليليًا، وهذا يعني أنهُ أكثر نشاطًا في الليل، ولكن هذا لا يمنع من ظهورهِ في النهار، وفي التالي سيتم الحديث عن حيوان الراكون بشيء من التفصيل.\n"
                  "\nموطن حيوان الراكون\n"
                  "يُفضل حيوان الراكون العيش في المناطق قليلة الغابات، والجحور والشقوق الصخرية، وأشجار البلوط، وقد لا يُفضل العيش في التضاريس المفتوحة، أو العيش في أشجار الزان؛ بسبب أنّ لحاء الزان يكون سلسًا للغاية بحيث يتعذر تسلقه، وتتواجد هذه المناطق في عدة دول حول العالم، فينتشر حيوان الراكون في جميع أنحاء أمريكا الشمالية من\n "
                  "\n\nكندا"
                  " وحتى بنما، فيتواجد بكثرة في مناطق سلاسل الجبال، مثل جبال روكي الغربية، كما يتواجد في المروج والمستنقعات الساحلية، وينتشر أيضًا في العديد من الدول الأوروبية والآسيوية، ففي عام 1966 تم إطلاق العديد منها من قبل أفراد القوات الجوية الأمريكية بالقرب من قاعدة لاون كوفرون الجوية في شمال فرنسا، ويتواجد أيضًا في إيطاليا، ومدريد، والاتحاد السوفيتي، وتم استيراد  1500 حيوانًا من الراكون كحيوانات أليفة بعد نجاح سلسلة الرسوم المتحركة الراكون راسكال في اليابان، مما أدى إلى توسع انتشار نطاق الراكون في البرية في\n "
                  "\nاليابان\n"
                  " من 17 محافظة في عام 2000 إلى جميع المحافظات الـ 47 في عام 2008، وتشير الإحصاءات لعام 2012 أنّ عدد حيوانات الراكون في ألمانيا وصل إلى أكثر من مليون راكون.\n"
                  "\nالتكيف البيئي و السلوكي لحيوان الراكون\n"
                  "يُعدّ الراكون من الحيوانات التي تأكل أي شيء تقريبًا، بدءًا من بقايا القمامة إلى الحشرات والنباتات والفئران والفواكه والضفادع\n "
                  "\nوالأسماك\n"
                  "، ويُعدّ النظام الغذائي الواسع الّذي يتميز بهِ الراكون من أهم الأسباب التي جعلته يتكيف مع جميع أنواع البيئات، بعكس بعض الحيوانات التي تنقرض بمجرد تدمير موائلها الطبيعية لبناء الأحياء والمدن، ومن العادات الغريبة التي يقوم بها حيوان الراكون، هي أنّهُ يقوم بغمر طعامهِ في الماء قبل تناوله، ولم يستطع أن يحدد العلماء أهمية هذه العادة بالنسبة للراكون، فبعضهم يقول أنّهُ يفعل ذلك لتنظيفها، وشبّه الكثير يد الراكون مع الأصابع الخمسة بيد الإنسان وأصابعهِ؛ فهو يستطيع عن طريقها أن يحمل أو يمسك بأيّ شيء تمامًا مثل الإنسان، كما يتمتع الراكون بجسد قوي مضاد للسقطات القوية، فساعدهُ ذلك في التسلق وعدم التضرر في حال السقوط من أعلى الشجرة، وبالرغم من أنّ أرجلهُ قصيرة، إلا أنّها قادرة على الجري السريع.\n"
                  "\nصيد الراكون\n"
                  "كما ذكر سابقًا فإنّ الراكون يتمتع بفراء سميك؛ مما جعلهُ محطًا للأنظار من قبل الصيادين؛ وذلك للاستفادة من فرائهِ، فيدخل في صناعة الملابس، والمعاطف والأغطية، ومنذ القرن الثامن عشر تم استخدام فراء الراكون في صناعة ملابس الرجال الّذين يقطنون المرتفعات الاسكتلندية التقليدية، واستخدموا ذيول الراكون للزينة، وفي مطلع القرن العشرين ازدادت عدد حيوانات الراكون التي يتم قتلها، وذلك لظهور وانتشار معاطف السيارات، وعُدَّ ارتداء المعطف المصنوع من فراء الراكون رمزًا للمكانة بين طلاب الجامعات، وفي عامي 1954 و 1955 تم عرض فيلم وثلاث حلقات تلفزيونية خاصة بالممثل ديفي كروكيت، حيث ظهر وهو يرتدي قبعة رقيقة يُعتقد أنّها مصنوعة من فراء الراكون، والّذي أدى إلى ارتفاع الطلب على القبعات الرقيقة في الولايات المتحدة ، بالإضافة إلى أنّ الراكون كان يستخدم كمصدر غذاء للأمريكيين الأصليين والمستوطنين الأمريكيين الأوائل\n"
              ,style: TextStyle(
                color: Colors.black,
                fontFamily: "Pacifico",
                fontSize: 20,
              ),
              textDirection: TextDirection.rtl,
            ),
          )
        ],
      ),
    );
  }
}
